Revit 2027 API
BalusterInfo.Offset Property
 The side offset of the baluster/post from the railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Offset { get; set; }
Public Property Offset As Double
	Get
	Set
public:
property double Offset {
	double get ();
	void set (double value);
}
member Offset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace